# ElementId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Reference..::..ElementId Property
Reference Class See Also
---
The element id for this reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId ElementId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ElementId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ElementId {
	ElementId^ get ();
}
```

# Remarks
InvalidElementId will be returned for references that don't refer to a particular element.
# See Also
Reference Class
Autodesk.Revit.DB Namespace